{
   "published":true,
   "name":"Home page",
   "folder": {
      "root":false,
      "documents":[],
      "folders":[],
      "parent":"5ae9f2a4323fc90013cb4dfb",
      "name":"progressPipeline-org",
      "createdAt":"2018-07-11T16:30:48.381Z",
      "updatedAt":"2018-07-11T16:30:48.381Z",
      "id":"5b4630b87333870013365417"
   },
   "createdAt":"2018-07-11T16:31:06.307Z",
   "updatedAt":"2018-10-04T20:59:07.148Z",
   "id":"5b4630ca1045420013ea11f3",
   "blocks": [
      {
         "type":"Simple_Text",
         "name":"Home Header",
         "apiId":"homeHeader",
         "value":"Progressive Talent Pipeline",
         "document":"5b4630ca1045420013ea11f3"
      }, {
         "type":"Markdown",
         "name":"Home Main Content",
         "apiId":"homeMainContent",
         "value":"A “blue wave” this November could bring transformative change to Washington. But, to realize the potential, it’s not only necessary to win elections. It’s also necessary to plan for what happens after Democratic gains are made in one or both houses on Capitol Hill.\n\nWith projected Democratic gains in November, there will likely be a necessity to hire upwards of 150 new legislative policy staffers.  To meet this requirement, we’ll need a major new infusion of talent in Washington.\n\nA coalition of organizations, including the [Congressional Progressive Caucus Center](http://www.progressivecongress.org/), and under the advisement of Progressive Caucus Co-Chair Mark Pocan (WI-02) and First Vice Chair Pramila Jayapal (WA-07), are looking to build a slate of talented and diverse progressives to present to new and current Members of Congress as potential new staff hires following the November elections.\n\n**We’re looking for exceptional and diverse progressive thinkers, writers, and organizers who want to support the kind of policy objectives members of the Congressional Progressive Caucus are leading on.** \n\nCongressional staff have long played a crucial role in government—negotiating and writing legislation, advising agencies, conducting investigations, and communicating policies to the public.  Staff capacity will be key to developing creative ideas, converting them into sound policies, messaging them effectively, and mobilizing the electorate around them—all while holding the administration accountable.\n\nThis is a unique opportunity to enhance governing capacity and help shape future policymaking on Capitol Hill. ",
         "document":"5b4630ca1045420013ea11f3"
      }, {
         "type":"Simple_Text",
         "name":"Apply Header",
         "apiId":"applyHeader",
         "value":"Apply",
         "document":"5b4630ca1045420013ea11f3"
      }, {
         "type":"Markdown",
         "name":"Apply Main Content",
         "apiId":"applyMainContent",
         "value":"Applying for the talent pipeline is simple and straightforward.  Upload two documents below, following the instructions. All applications submitted by September 30th, 2018 will be reviewed. Applications received thereafter will be reviewed to the extent to which capacity permits.\n\n1. Your CV or Resume:*\n\n2. A document with your answers to the following two questions:*\n\n\t1. Why do you want to work on Capitol Hill? (300 Words)\n\n\t2. If you could wave a magic wand and pass three laws at the federal level, what would they be and why would you choose each of them?  (Up to 300 words) \n\t\n\t\n\t\n\t\n\t\n",
         "document":"5b4630ca1045420013ea11f3"
      }, {
         "type":"Markdown",
         "name":"About Main Content",
         "apiId":"aboutMainContent",
         "value":"The most capable, principled, energized would-be staffers are often bewildered by the process of landing employment on Capitol Hill. Those interested in congressional positions have traditionally had to deal with the [uncertainty of joining a political campaign](https://www.washingtonpost.com/posteverything/wp/2015/10/05/congress-is-a-dysfunctional-mess-heres-why-you-should-want-to-work-here-anyway/?noredirect=on&utm_term=.f17573a66313) or the [excessive costs of taking on an unpaid internship or fellowship](https://wamu.org/story/17/07/20/whats-like-unpaid-intern-capitol-hill/).  These are practically the only ways that people can land employment in Congress currently.  \n\nWhile working in Congress is one of the most strategic ways to impact policy-making and shape the national political discourse, progressives who are committed to advancing the public interest have an easier time initiating their careers in the nonprofit, academic or the private sectors.\n\nThe absence of onramps makes it difficult to recruit the talented,qualified, and committed staffers needed to drive change.\n\nWe want Congress to be staffed with people who look like America so that we can ensure that the people helping make federal policy authentically understand and can effectively respond to the needs of communities and causes that can’t afford high-priced lobbyists.\n\nGiven the insularity of Hill hiring and the lack of open onramps into legislative branch service, communities of color often face the most significant hurdles.  Last year, for the first time ever, Senate Democrats [reported on demographics for staff](https://www.washingtonpost.com/powerpost/democratic-senate-staffers-are-mostly-white-and-women-new-report-says/2017/06/30/1cdcf5d6-5db2-11e7-a9f6-7c3296387341_story.html?utm_term=.f7b54a7f4e5d), and the numbers were startling. There are only three Black chiefs of staff in the entire Senate (and two serve in Republican offices).\n\n**A new Progressive Talent Pipeline can help solve these challenges.**  A coalition of respected organizations, led by the new Progressive Caucus Center, is seeking to implement this new solution. The new initiative will:\n\n(1) identify talented and diverse progressives around the country through educational, organizing, and advocacy networks,\n\n(2) recruit these individuals to apply to be part of an endorsed group of candidates,\n\n(3) provide these endorsed candidates intensive training on how to succeed in a Congressional office through a three-day program in November 2018,\n\n(4) present newly-elected Democratic Members of Congress with the slate of endorsed candidates, and provide opportunities for these incoming lawmakers to meet with the candidates prior to the start of the new Congress,\n\n(5) provide continuous training and support for staffers, once placed in Congressional offices, including skill-development, research assistance, and strategy meetings with allies and experts\n\n(6) maintain a roster of exceptional vetted candidates for Hill positions, track new openings in Congressional offices, and seek to ensure placement of qualified candidates.\n\nConservatives got the message about the importance of Congressional staff capacity decades ago. Today, there’s a large network of capacity-building programs on the right, including the Heritage Foundation’s Young Leaders Program, the Charles Koch Institute’s Hill-focused professional development programs, the Federalist Society’s multifaceted pipeline for right-wing legal talent, Capitol Hill staff programs from the conservative Tax Foundation and Mercatus Center, and multiple talent development programs from neoconservative groups like the Foundation for Defense of Democracies and the Foreign Policy Initiative. Well-staffed strategy platforms like the Republican Study Committee have long been essential to GOP policy development, coordination, and communication. \n\nAs Senator Elizabeth Warren is fond of saying: “[personnel is policy.](https://www.nytimes.com/2016/01/29/opinion/elizabeth-warren-one-way-to-rebuild-our-institutions.html)”  If Democrats want to restore a trustworthy and capable government and design and implement a successful long-term policy agenda, it’s essential to start focusing on people.\n\n **Advisory Board**\n\n**Rep. Mark Pocan (D-WI)** | Congressional Progressive Caucus\n\n**Rep. Pramila Jayapal (D-WA)** | Congressional Progressive Caucus\n\n**Rep. Keith Ellison (D-MN)** | Congressional Progressive Caucus\n\n**Thea Lee** | Economic Policy Institute\n\n**Richard Parker** | Harvard University - Kennedy School of Government\n\n**Zinelle October** | American Constitution Society\n\n**Mike Sozan** | Center for American Progress\n",
         "document":"5b4630ca1045420013ea11f3"
      },{ 
         "type":"Simple_Text",
         "name":"About Header",
         "apiId":"aboutHeader",
         "value":"About the Program",
         "document":"5b4630ca1045420013ea11f3"
      },{ 
         "type":"Simple_Text",
         "name":"Home",
         "apiId":"home",
         "value":"Why Work On Capitol Hill ",
         "document":"5b4630ca1045420013ea11f3"
      },{ 
         "type":"Markdown",
         "name":"Why Work Main Content",
         "apiId":"whyWorkMainContent",
         "value":"It’s still one of the most strategic ways to serve. For people focused on building progressive power and holding the current Administration accountable, working in Congress is arguably the most direct way to meet call of the current era. \n\nCapitol Hill is where many of America’s most consequential questions — from the scope of the Pentagon budget to the shape of the tax code — get answered. As a staffer, you’re remarkably close to the action and the decision-making authority. This doesn’t just mean access; it means opportunity to be entrepreneurial.  \n\nAs even a junior policy staffer, you may have opportunities to: \n\n* Design and write legislation\n\n* Propose amendments to appropriations bills and other measures \n \n* Educate Members of Congress on policy issues and proposed solutions \n\n* Bring attention to issues by organizing briefings and hearings in partnership with outside think tanks and advocacy organizations\n \n* Design and organize investigations and exercise oversight \n\n* Draft and publish high-profile opinion articles and other media \n\n* Work on a diverse portfolio of policy issues ",
         "document":"5b4630ca1045420013ea11f3"
      },{
         "type":"Markdown",
         "name":"Why Apply Content",
         "apiId":"whyApplyContent",
         "value":"We are developing a new system for connecting committed progressives from diverse backgrounds to Congressional offices. Key outside groups and Members of Congress have come to recognize that there has not been an obvious entry point for potential staffers that do not already have insider connections and are not yet trained in the workings of Congress. We want to fix this, so we are joining forces to build a new onramp for people who might not previously been able to apply for this vital and rewarding work. By applying to become an endorsed candidate to work on the Hill through the new Progressive Talent Pipeline, you can help Congress overcome these challenges. We’re searching far and wide for committed progressives to work in interested offices. Members of the Progressive Caucus have led signature legislative efforts such as: Medicare for All, opposing militarism, advancing full employment and a jobs guarantee, ending mass incarceration, addressing climate change, promoting reproductive justice, instituting humane immigration policies, opposing discrimination, expanding voting rights, and other priorities.\n\n**Why apply? If you are selected as an endorsed candidate, here are some of the benefits you’ll receive:**\n* Consideration for Hill positions as part of a small recommended group of candidates through the Congressional Progressive Caucus leadership.\n\n* Potential opportunities to meet with newly-elected Members of Congress as they begin making hiring decisions.\n\n* Extensive training in how to succeed in a Congressional office, including instruction on legislative strategy and bill drafting, communications, and management from senior staffers and outside experts.\n\n* If placed in a Congressional staff position, we will also seek to match you with a mentor (a seasoned progressive Hill staffer) and offer opportunities for continuing education and support from allied think tanks and policy organizations.\n\n**Want to apply? Here are your next steps and timeline:**\n\n1. Send along your resume and answers to two brief essay questions through the link on this site, and we’ll assess your application (By September 30)\n\n2. If you’re selected for the program, you’ll be part of an “endorsed group” of candidates for staff positions and recommended to both new and incumbent member offices that are hiring (endorsed slate chosen in October)\n\n3. A subset of selected applicants will receive an invitation to an intensive multi-day training program in DC. This training program will provide in-depth information on how to navigate the arcana of work in the legislative branch, including appropriations processes, committee procedures, amendment strategies, best practices in media outreach and office management, and other matters. You’ll learn from top current and former Hill staffers. (Training program and initial placement efforts in November)\n\n4. If you’re selected for a staff position, you’ll be invited to participate in regular strategy sessions with other Progressive Pipeline fellows and representatives from a range of progressive think tanks and NGOs.\n\nYou’ll receive ongoing training and support for your work on the Hill.\n(Starting with the 116th Congress in early 2019)\n\n",
         "document":"5b4630ca1045420013ea11f3"
      },{
         "type":"Simple_Text",
         "name":"Why Apply Header",
         "apiId":"whyApplyHeader",
         "value":"Why Apply",
         "document":"5b4630ca1045420013ea11f3"
      },{
         "type":"Simple_Text",
         "name":"Who we're looking for Header",
         "apiId":"whoWeReLookingForHeader",
         "value":"Who we are looking for",
         "document":"5b4630ca1045420013ea11f3"
      },{
         "type":"Markdown",
         "name":"Who we're looking for Content",
         "apiId":"whoWeReLookingForContent",
         "value":"We’re aiming to identify exceptional early-to-mid career individuals and communications to serve as legislative staffers.  \n\nAcross the board, we’re looking for a deep commitment to social, economic, and environmental justice that is aligned with the policy objectives of the Congressional Progressive Caucus.\n\nMembers of the Progressive Caucus have been at the forefront of advancing *Medicare for All; full employment and a jobs guarantee; an end to mass incarceration and homelessness; major public investments to tackle climate change; an end to militarism, unconstitutional wars, and regime-change policies; criminal justice reform; reining in the power of Wall Street and Big Pharma; reproductive justice; expanding voting rights; instituting a humane immigration system, and other priorities.* \n\nBecause it is important to ensure that historically disenfranchised communities play a leading part in constructing the policies that govern our society, we are also seeking to recruit and support people from diverse backgrounds who want to work in Congress to advance these issues\n\nWe’re seeking recommendations for three categories:\n\n**Subject Matter Experts (Professional Committee Staff and Senior Legislative Staff)**\n\n* Recognized expertise in one or more areas of public policy, law, or investigative journalism, such as: immigration, foreign policy, climate policy\n\n* Substantial work experience in policy, organizing, law, journalism, or other relevant fields.\n\n* A record of publications or other professional accomplishments \n\n* Exceptional writing, interpersonal skills, and technical competence in policymaking\n\n* Graduate degree generally required\n\n* Subject Matter Experts, including Professional Committee Staff, can expect to be compensated starting at $85,000.\n\n**Mid-Level Policy Staff (Policy Advisers, Counsels, Press Secretary/Communications Director, and Legislative Assistants)**\n\n* Strong demonstrated commitment to social and economic justice\n\n* Substantive work experience in policy, organizing, law, journalism, or other relevant fields.\n\n* Exceptional writing, interpersonal skills, and technical competence in policymaking\n\n* Graduate degree preferred\n\n* Mid-Level Policy Staff including, Counsels, Legislative Assistants, Press Secretary/Communications Directors, and Policy Advisers, can expect to be compensated in the range of $40,000 - $60,000. \n\n**Entry-Level Staff (Legislative Correspondents, Staff Assistants, Press Assistants, and Policy Interns)**\n\n* Strong demonstrated commitment to social and economic justice\n\n* Excellent writing, interpersonal skills, and basic competence in policymaking\n\n* Strong academic credentials and work experience in relevant fields \n\n* Excellent writing, interpersonal skills, and basic competence in policymaking\n\n* Entry-Level Staff, including Legislative Correspondents, Junior Legislative Assistants, Staff Assistants, and Press Assistants can expect to be compensated starting at $40,000.\n\n\n",
         "document":"5b4630ca1045420013ea11f3"
      }
   ]
}